/*2. Направете макро, което да се казва ARRAY_SIZE, което да съдържа големина на масив.
Декларирайте масив с големина ARRAY_SIZE,
който ако макрото ARRAY_SIZE e дефинирано и неговата стойност е по-малка  от 10 по-голяма от 0 да е от тип double.
Елементите в масива, трябва да са последователни степени на двойката: първия елемент е 1 (2^0), вторият 2(2^1),
третият 4(2^2) и така всеки следващ елемент да е следващата степен на двойката. Програмата трябва да е направена така,
че ако се промени стойността на макрото, масивът да се попълва автоматично (масивът не трябва да е ръчно зададен).*/

#include<stdio.h>
#define ARRAY_SIZE 7

 int main()
 {
    #if (ARRAY_SIZE<10 && ARRAY_SIZE>0)
    double a[ARRAY_SIZE];

    int b=0;
    for(int i=0;i<ARRAY_SIZE;i++)
    {
      b=0;
      a[i]=1;
     while(b<i)
     {
        a[i]=a[i]*2;
        b=b+1;
     }
     printf("%lf\n",a[i]);
    }
    #endif
    return 0;
 }