/*4. Направете функция, която да приема двумерен целочислен масив, който може да има произволен брой редове но да има четири колони и да го принтира като таблица, използвайки адресна аритметика. Функцията трябва да приема също така и броят на редовете (броят на колоните не е нужен, защото той винаги е четири). Хубаво е да дефинирате макрота за размерите, които да преизползвате.*/
#include<stdio.h>
#define COLUMNS 4
#define ROWS 4

void function(int arr[][COLUMNS], int rows)
{
    for(int i=0;i<rows;i++)
    {
        for(int j=0; j<COLUMNS;j++)
        {
            printf("%-4d",*(*(arr+i)+j));
        }
        printf("\n");
    }
}

void main(void)
{
    int arr[][COLUMNS] = {
        {1,2,3,4},
        {5,6,7,8},
        {9,10,11,12},
    };
    function(arr,ROWS);
}