/*5.Направете макро функция (SWAP(А, B, TYPE)), което да разменя стойностите на две променливи от произволен тип. Помощ: въведете типа като допълнителен аргумент на макро функцията. Демонстрирайте използването на подобно макро. Когато дефинирате макрото за да се чете по лесно кодът, можете да слагата “/” за да направите макрото на няколко реда.*/
#include<stdio.h>

#define SWAP(A,B,TYPE) TYPE c = A;\
                        A = B;\
                         B = c;
                       

void main()
{
    int a=9,b=0;
    SWAP(a,b,int)
    printf("%d %d",a,b);
}